IDEA Open Model
BeamData.Cuts Property
 Cuts on the beam
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public List<CutData> Cuts { get; set; }
Public Property Cuts As List(Of CutData)
	Get
	Set
public:
property List<CutData^>^ Cuts {
	List<CutData^>^ get ();
	void set (List<CutData^>^ value);
}
Property Value
Type: List<CutData>
See Also
Reference
BeamData Class
IdeaRS.OpenModel.Connection Namespace